# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "бананнананан", "киви", "арбуз"]

max_len = len(max(fruits, key=len))
format_string = '{}. {:>' + str(max_len) + '}'
for i, fr in enumerate(fruits, 1):
    print(format_string.format(i, fr))

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
